# Ultralytics YOLO 🚀, GPL-3.0 license

# My Change:
#  1. SPPF-->SimSPPF 
#  2. 

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.25  # scales convolution channels

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, CSPSPPF, [1024, 5]]  # 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 15 (P3/8-small)

  - [-1, 1, GhostConv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 18 (P4/16-medium)

  - [-1, 1, GhostConv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 21 (P5/32-large)
  
#   - [[3, 15], 1, Concat, [1]]  # cat backbone P4 #版本1
#   - [[-1, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)

#   - [3, 1, SE, [256]] #版本2
#   - [[-1, 15], 1, Concat, [1]]  # cat backbone P4 
#   - [[-1, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)

#   - [2, 1, Conv, [128, 3, 2]]#版本3
#   - [[-1, 15], 1, Concat, [1]]  # cat backbone P4 
#   - [[-1, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)
  
#   - [2, 1, Conv, [128, 3, 2]]#版本4
  - [[3, 15], 1, Concat, [1]]  # cat backbone P4 
  - [[-1, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)

# #   - [2, 1, Conv, [128, 3, 2]]#版本5
#   - [[3, 15], 1, Concat, [1]]  # cat backbone P4 
#   - [-1, 1, SE, [512]] #SE
#   - [[-1, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)

#   - [15, 1, nn.Upsample, [None, 2, 'nearest']]#版本6
#   - [[-1, 2], 1, Concat, [1]]  # 
#   - [-1, 3, C2f, [512]]  # 
#   - [[-1,15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)

#   - [15, 1, nn.Upsample, [None, 2, 'nearest']]#版本7
#   - [[-1, 2], 1, Concat, [1]]  # 
#   - [-1, 3, C2f, [512]]  # 
  - [[2,15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)
