# # Ultralytics YOLO 🚀, GPL-3.0 license

# # My Change:
# #  1. SPPF-->SimSPPF 
# #  2. 

# # Parameters
# nc: 1  # number of classes
# depth_multiple: 0.33  # scales module repeats
# width_multiple: 0.25  # scales convolution channels

# # YOLOv8.0n backbone
# backbone:
#   # [from, repeats, module, args]
#   - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
#   - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
#   - [-1,1,space_to_depth,[1]]  # 2
#   - [-1, 3, C2f, [128, True]]   # 3
#   - [-1, 1, Conv, [256, 3, 2]]  # 4   3-P3/8
#   - [-1,1,space_to_depth,[1]]  # 5
#   - [-1, 6, C2f, [256, True]]   # 4--->6
#   - [-1, 1, Conv, [512, 3, 2]]  # 7  5-P4/16
#   - [-1,1,space_to_depth,[1]]  # 8  
#   - [-1, 6, C2f, [512, True]]        6-->9
#   - [-1, 1, Conv, [1024, 3, 2]]  # 10  7-P5/32
#   - [-1,1,space_to_depth,[1]]  # 11
#   - [-1, 3, C2f, [1024, True]]    
#   - [-1, 1, SimSPPF, [1024, 5]]  # 13  9--->13  (+4)

# # YOLOv8.0n head
# head:
#   - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
#   - [[-1, 9], 1, Concat, [1]]  # cat backbone P4  [6-->9]
#   - [-1, 3, C2f, [512]]  # 13

#   - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
#   - [[-1, 6], 1, Concat, [1]]  # cat backbone P3  [4--->6]
#   - [-1, 3, C2f, [256]]  # 17 (P3/8-small)

#   - [-1, 1, Conv, [256, 3, 2]]
#   - [[-1, 16], 1, Concat, [1]]  # cat head P4  [12--->16]
#   - [-1, 3, C2f, [512]]  # 20 (P4/16-medium)

#   - [-1, 1, Conv, [512, 3, 2]]
#   - [[-1, 13], 1, Concat, [1]]  # cat head P5  [9-->13]
#   - [-1, 3, C2f, [1024]]  # 23 (P5/32-large)

#   - [[19, 22, 25], 1, Detect, [nc]]  # Detect(P3, P4, P5)[15 18 21-->19 22 25]

# Ultralytics YOLO 🚀, GPL-3.0 license

# My Change:
#  1. SPPF-->SimCSPSPPF 
#  2. 

# Parameters
nc: 1  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.25  # scales convolution channels

# YOLOv8.0n backbone    Focus
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Focus, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Focus, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Focus, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Focus, [1024, 3, 2]]  # 7-P5/32
#   - [-1,1,space_to_depth,[1]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SE, [1024]]  #SE
  - [-1, 1, SPPF, [1024, 5]]  # 9--->10

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P4------------>12---->13
  - [-1, 3, C2f, [512]]  # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # cat head P5 ---> 9------>10
  - [-1, 3, C2f, [1024]]  # 23 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]  # Detect(P3, P4, P5)  15 18 21 -->16 19 22
